In [1]:
# Import pandas package
import pandas as pd

In [2]:
# Assign data
data={'Name':['Jai','Princi','Gaurav','Anuj','Ravi','Natasha','Riya'],
      'Age':[17, 17, 18, 17, 18, 17, 17],
      'Gender':['M','F','M','M','M','F','F'],
      'Marks':[90,76,'NaN', 74, 65, 'NaN',71]}

In [3]:
# Convert into DataFrame
df=pd.DataFrame(data)

In [4]:
# Display data
df

      Name  Age Gender Marks
0      Jai   17      M    90
1   Princi   17      F    76
2   Gaurav   18      M   NaN
3     Anuj   17      M    74
4     Ravi   18      M    65
5  Natasha   17      F   NaN
6     Riya   17      F    71

Dealing with missing values in Python

In [5]:
# Compute average
c=avg=0
for ele in df['Marks']:
    if str(ele).isnumeric():
        c+=1
        avg+=ele
avg/=c

In [6]:
# Replace missing values
df=df.replace(to_replace="NaN", value=avg)

C:\Users\Dell\AppData\Local\Temp\ipykernel_13616\2977634559.py:2: FutureWarning: Downcasting behavior in `replace` is deprecated and will be removed in a future version. To retain the old behavior, explicitly call `result.infer_objects(copy=False)`. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  df=df.replace(to_replace="NaN", value=avg)

In [7]:
# Display data
df

      Name  Age Gender  Marks
0      Jai   17      M   90.0
1   Princi   17      F   76.0
2   Gaurav   18      M   75.2
3     Anuj   17      M   74.0
4     Ravi   18      M   65.0
5  Natasha   17      F   75.2
6     Riya   17      F   71.0

Data Replacing in Data Wrangling

In [8]:
# Categorize gender
df['Gender']=df['Gender'].map({'M':0,'F':1}).astype(float)

In [9]:
# Display data
df

      Name  Age  Gender  Marks
0      Jai   17     0.0   90.0
1   Princi   17     1.0   76.0
2   Gaurav   18     0.0   75.2
3     Anuj   17     0.0   74.0
4     Ravi   18     0.0   65.0
5  Natasha   17     1.0   75.2
6     Riya   17     1.0   71.0

Filtering data in Data Wrangling

In [10]:
# Filter top scoring students
df=df[df['Marks']>=75].copy()

In [11]:
# Remove age column from filtered DataFrame
df.drop('Age',axis=1,inplace=True)

In [12]:
# Display data
df

      Name  Gender  Marks
0      Jai     0.0   90.0
1   Princi     1.0   76.0
2   Gaurav     0.0   75.2
5  Natasha     1.0   75.2

Data Wrangling Using Merge Operation

In [13]:
# import module
import pandas as pd

In [14]:
# creating DataFrame for Student Details
details = pd.DataFrame({
 'ID': [101, 102, 103, 104, 105, 106, 107, 108, 109, 110],
 'NAME': ['Jagroop', 'Praveen', 'Harjot', 'Pooja', 'Rahul', 'Nikita', 'Saurabh', 'Ayush', 'Dolly', 'Mohit'],
 'BRANCH': ['CSE', 'CSE', 'CSE', 'CSE', 'CSE', 'CSE', 'CSE', 'CSE', 'CSE', 'CSE']})

In [15]:
# printing details
print(details)

    ID     NAME BRANCH
0  101  Jagroop    CSE
1  102  Praveen    CSE
2  103   Harjot    CSE
3  104    Pooja    CSE
4  105    Rahul    CSE
5  106   Nikita    CSE
6  107  Saurabh    CSE
7  108    Ayush    CSE
8  109    Dolly    CSE
9  110    Mohit    CSE

In [16]:
# Import module
import pandas as pd

In [17]:
# Creating Dataframe for Fees_Status
fees_status = pd.DataFrame({'ID': [101, 102, 103, 104, 105, 106, 107, 108, 109, 110],
                            'PENDING': ['5000', '250', 'NIL', '9000', '15000', 'NIL', '4500', '1800', '250', 'NIL']})

In [18]:
# Printing fees_status
print(fees_status)

    ID PENDING
0  101    5000
1  102     250
2  103     NIL
3  104    9000
4  105   15000
5  106     NIL
6  107    4500
7  108    1800
8  109     250
9  110     NIL

Data Wrangling Using Merge Operation

In [19]:
# Import module
import pandas as pd

In [20]:
# Creating Dataframe
details = pd.DataFrame({'ID': [101, 102, 103, 104, 105, 106, 107, 108, 109, 110],
                        'NAME': ['Jagroop', 'Praveen', 'Harjot', 'Pooja', 'Rahul', 'Nikita', 'Saurabh', 'Ayush', 'Dolly', "Mohit"],
                        'BRANCH': ['CSE', 'CSE', 'CSE', 'CSE', 'CSE', 'CSE', 'CSE', 'CSE', 'CSE', 'CSE']})

In [21]:
# Creating Dataframe
fees_status = pd.DataFrame({'ID': [101, 102, 103, 104, 105, 106, 107, 108, 109, 110],
                            'PENDING': ['5000', '250', 'NIL', '9000', '15000', 'NIL','4500', '1800', '250', 'NIL']})

In [22]:
# Merging Dataframe
print(pd.merge(details, fees_status, on='ID'))

    ID     NAME BRANCH PENDING
0  101  Jagroop    CSE    5000
1  102  Praveen    CSE     250
2  103   Harjot    CSE     NIL
3  104    Pooja    CSE    9000
4  105    Rahul    CSE   15000
5  106   Nikita    CSE     NIL
6  107  Saurabh    CSE    4500
7  108    Ayush    CSE    1800
8  109    Dolly    CSE     250
9  110    Mohit    CSE     NIL